leihaoda/MCO556-TrafficLights/Software/Project_Headers/mc9s08gb32.h
typedef union {
	byte	Byte;
	struct {
		byte LED8	: 1;
		byte LED9	: 1;
		byte rsvd	: 6;
	} Bits;
}LEDHSTR;
extern volatile LEDHSTR _LEDRH @0x00000009;

#define LEDRH     	_LEDRH.Byte
#define LEDRL     	_LEDRL.Byte
#define LEDG    	_LEDG.Byte

#define LEDR_LED0	_LEDRL.Bits.LED0
#define LEDR_LED1	_LEDRL.Bits.LED1
#define LEDR_LED2	_LEDRL.Bits.LED2
#define LEDR_LED3	_LEDRL.Bits.LED3
#define LEDR_LED4	_LEDRL.Bits.LED4
#define LEDR_LED5	_LEDRL.Bits.LED5
#define LEDR_LED6	_LEDRL.Bits.LED6
#define LEDR_LED7	_LEDRL.Bits.LED7
#define LEDR_LED8	_LEDRH.Bits.LED8
#define LEDR_LED9	_LEDRH.Bits.LED9
#define LEDG_LED0	_LEDG.Bits.LED0
#define LEDG_LED1	_LEDG.Bits.LED1
#define LEDG_LED2	_LEDG.Bits.LED2
#define LEDG_LED3	_LEDG.Bits.LED3
#define LEDG_LED4	_LEDG.Bits.LED4
#define LEDG_LED5	_LEDG.Bits.LED5
#define LEDG_LED6	_LEDG.Bits.LED6
#define LEDG_LED7	_LEDG.Bits.LED7

#define LEDR_LED0_MASK             1U
#define LEDR_LED1_MASK             2U
#define LEDR_LED2_MASK             4U
#define LEDR_LED3_MASK             8U
#define LEDR_LED4_MASK             16U
#define LEDR_LED5_MASK             32U
#define LEDR_LED6_MASK             64U
#define LEDR_LED7_MASK             128U
#define LEDR_LED8_MASK             1U
#define LEDR_LED9_MASK             2U
#define LEDG_LED0_MASK             1U
#define LEDG_LED1_MASK             2U
#define LEDG_LED2_MASK             4U
#define LEDG_LED3_MASK             8U
#define LEDG_LED4_MASK             16U
#define LEDG_LED5_MASK             32U
#define LEDG_LED6_MASK             64U
#define LEDG_LED7_MASK             128U

// switches
typedef union {
	byte	Byte;
	struct {
		byte SWL0	: 1;
		byte SWL1	: 1;
		byte SWL2	: 1;
		byte SWL3	: 1;
		byte SWL4	: 1;
		byte SWL5	: 1;
		byte SWL6	: 1;
		byte SWL7	: 1;
	} Bits;
}SWLSTR;
extern volatile SWLSTR _SWL @0x00000012;

typedef union {
	byte	Byte;
	struct {
		byte SWH8	: 1;
		byte SWH9	: 1;
		byte rsvd	: 3;
		byte KEY1	: 1;
		byte KEY2	: 1;
		byte KEY3	: 1;
	} Bits;
}SWHSTR;
extern volatile SWHSTR _SWH @0x00000011;

#define SWH     _SWH.Byte
#define SWL     _SWL.Byte

#define SW_SW0	_SWL.Bits.SWL0
#define SW_SW1	_SWL.Bits.SWL1
#define SW_SW2	_SWL.Bits.SWL2
#define SW_SW3	_SWL.Bits.SWL3
#define SW_SW4	_SWL.Bits.SWL4
#define SW_SW5	_SWL.Bits.SWL5
#define SW_SW6	_SWL.Bits.SWL6
#define SW_SW7	_SWL.Bits.SWL7
#define SW_SW8	_SWH.Bits.SWH8
#define SW_SW9	_SWH.Bits.SWH9
#define SW_KEY1	_SWH.Bits.KEY1
#define SW_KEY2	_SWH.Bits.KEY2
#define SW_KEY3	_SWH.Bits.KEY3

#define SW_SW0_MASK             1U
#define SW_SW1_MASK             2U
#define SW_SW2_MASK             4U
#define SW_SW3_MASK             8U
#define SW_SW4_MASK             16U
#define SW_SW5_MASK             32U
#define SW_SW6_MASK             64U
#define SW_SW7_MASK             128U
#define SW_SW8_MASK             1U
#define SW_SW9_MASK             2U
#define SW_KEY1_MASK            32U
#define SW_KEY2_MASK            64U
#define SW_KEY3_MASK            128U

// FIR
typedef union {
	byte	ByteRd;
	byte	ByteWr;
	struct {
		byte OVR	: 1;		// Right channel Overflow
		byte OVL	: 1;		// Left channel Overflow
		byte 		: 1;
		byte 		: 1;
		byte 		: 1;
		byte Full	: 1;		// New result available
		byte FIE	: 1;		// Interrupt enable
		byte Busy	: 1;		// Executing command
	} BitsRd;
	struct {
		byte Cmd	: 4;
		byte rsvd	: 4;
	} BitsWr;
}FIRSTR;
extern volatile FIRSTR _FIRSC @0x00000041;

#define FIRCMD  	_FIRSC.ByteWr
#define FIRSTAT		_FIRSC.ByteRd

#define FIRSTAT_OVR		_FIRSC.BitsRd.OVR
#define FIRSTAT_OVL		_FIRSC.BitsRd.OVL
#define FIRSTAT_FULL	_FIRSC.BitsRd.Full
#define FIRSTAT_FIE		_FIRSC.BitsRd.FIE
#define FIRSTAT_BUSY	_FIRSC.BitsRd.Busy
#define FIR_CMD			_FIRSC.BitsWr.Cmd

#define FIRSTAT_OVR_MASK             1U
#define FIRSTAT_OVL_MASK             2U
#define FIRSTAT_FULL_MASK            32U
#define FIRSTAT_FIE_MASK             64U
#define FIRSTAT_BUSY_MASK            128U

// FIR commands
#define	mNOP			 0U		// NOP
#define	mSetTaps		 1U		// set number of taps
#define	mSetCoefAddr	 2U		// set coefficient address
#define	mSetTapAddr		 3U		// set signal tap address
#define	mWrtCoefData	 4U		// write coefficient data to both channels (MSbyte of left channel first)
#define	mWrtTapData		 5U		// write signal tap data to both channels (MSbyte of left channel first)
#define	mWrtDataBoth	 6U		// write input signal data to both channels (MSbyte of left channel first)
#define	mWrtDataRight	 7U		// write input signal data to right channel only (MSbyte first)
#define	mReadDataBoth	 8U		// read output sample from both channels (MSbyte of left channel first)
#define	mReadDataRight	 9U		// read output sample from right channel only (MSbyte first)
#define	mReadTaps		 10U	// read number of taps
#define	mReadCoefData	 12U	// read coefficient data from both channels (MSbyte of left channel first)
#define	mReadSigData	 13U	// read signal tap data from both channels (MSbyte of left channel first)
#define	mFIR_DisableInt	 14U	// disable FIR interrupts
#define	mFIR_EnableInt	 15U	// enable FIR interrupts

extern volatile byte _FIRDAT @0x00000042;

// Audio Codec
typedef union {
	byte	ByteRd;
	byte	ByteWr;
	struct {
		byte 		: 1;
		byte 		: 1;
		byte 		: 1;
		byte 		: 1;
		byte 		: 1;
		byte Full	: 1;		// New result available
		byte ACIE	: 1;		// Interrupt enable
		byte Busy	: 1;		// Executing command
	} BitsRd;
	struct {
		byte Cmd	: 3;
		byte rsvd	: 5;
	} BitsWr;
}ACSTR;
extern volatile ACSTR _ACSC @0x00000045;

#define ACCMD  		_ACSC.ByteWr
#define ACSTAT		_ACSC.ByteRd

#define ACSTAT_FULL		_ACSC.BitsRd.Full
#define ACSTAT_FIE		_ACSC.BitsRd.FIE
#define ACSTAT_BUSY		_ACSC.BitsRd.Busy
#define AC_CMD			_ACSC.BitsWr.Cmd

#define ACSTAT_FULL_MASK            32U
#define ACSTAT_FIE_MASK             64U
#define ACSTAT_BUSY_MASK            128U

// Audio Codec commands
// #define	mNOP			 0U		// NOP
#define	mCtrlWr			 1U		// Write control word to Codec
#define	mLeftWr			 2U		// Write Left channel output
#define	mRightWr		 3U		// Write Right channel output
#define	mLeftRd			 4U		// Read Left channel input
#define	mRightRd		 5U		// Read Right channel input
#define	mAC_DisableInt	 6U		// disable AC interrupts
#define	mAC_EnableInt	 7U		// enable AC interrupts

extern volatile byte _ACDAT @0x00000046;



/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* -----------------------------------------------------------
Exceptions in bit names of timer status and control registers
due to backward compatibility with previous releases */
#define TPM1C0SC_ELSxA    _TPM1C0SC.Bits.ELS0A
#define TPM1C0SC_ELSxB    _TPM1C0SC.Bits.ELS0B
#define TPM1C0SC_MSxA     _TPM1C0SC.Bits.MS0A
#define TPM1C0SC_MSxB     _TPM1C0SC.Bits.MS0B
#define TPM1C0SC_CHxIE    _TPM1C0SC.Bits.CH0IE
#define TPM1C0SC_CHxF     _TPM1C0SC.Bits.CH0F

#define TPM1C1SC_ELSxA    _TPM1C1SC.Bits.ELS1A
#define TPM1C1SC_ELSxB    _TPM1C1SC.Bits.ELS1B
#define TPM1C1SC_MSxA     _TPM1C1SC.Bits.MS1A
#define TPM1C1SC_MSxB     _TPM1C1SC.Bits.MS1B
#define TPM1C1SC_CHxIE    _TPM1C1SC.Bits.CH1IE
#define TPM1C1SC_CHxF     _TPM1C1SC.Bits.CH1F

#define TPM1C2SC_ELSxA    _TPM1C2SC.Bits.ELS2A
#define TPM1C2SC_ELSxB    _TPM1C2SC.Bits.ELS2B
#define TPM1C2SC_MSxA     _TPM1C2SC.Bits.MS2A
#define TPM1C2SC_MSxB     _TPM1C2SC.Bits.MS2B
#define TPM1C2SC_CHxIE    _TPM1C2SC.Bits.CH2IE
#define TPM1C2SC_CHxF     _TPM1C2SC.Bits.CH2F

