leihaoda/MCO556-TrafficLights/Software/Project_Headers/mc9s08gb32.h
#define TPM2C0SC_ELSxA    _TPM2C0SC.Bits.ELS0A
#define TPM2C0SC_ELSxB    _TPM2C0SC.Bits.ELS0B
#define TPM2C0SC_MSxA     _TPM2C0SC.Bits.MS0A
#define TPM2C0SC_MSxB     _TPM2C0SC.Bits.MS0B
#define TPM2C0SC_CHxIE    _TPM2C0SC.Bits.CH0IE
#define TPM2C0SC_CHxF     _TPM2C0SC.Bits.CH0F

#define TPM2C1SC_ELSxA    _TPM2C1SC.Bits.ELS1A
#define TPM2C1SC_ELSxB    _TPM2C1SC.Bits.ELS1B
#define TPM2C1SC_MSxA     _TPM2C1SC.Bits.MS1A
#define TPM2C1SC_MSxB     _TPM2C1SC.Bits.MS1B
#define TPM2C1SC_CHxIE    _TPM2C1SC.Bits.CH1IE
#define TPM2C1SC_CHxF     _TPM2C1SC.Bits.CH1F
#define TPM2C2SC_ELSxA    _TPM2C2SC.Bits.ELS2A
#define TPM2C2SC_ELSxB    _TPM2C2SC.Bits.ELS2B
#define TPM2C2SC_MSxA     _TPM2C2SC.Bits.MS2A
#define TPM2C2SC_MSxB     _TPM2C2SC.Bits.MS2B
#define TPM2C2SC_CHxIE    _TPM2C2SC.Bits.CH2IE
#define TPM2C2SC_CHxF     _TPM2C2SC.Bits.CH2F

#define TPM2C3SC_ELSxA    _TPM2C3SC.Bits.ELS3A
#define TPM2C3SC_ELSxB    _TPM2C3SC.Bits.ELS3B
#define TPM2C3SC_MSxA     _TPM2C3SC.Bits.MS3A
#define TPM2C3SC_MSxB     _TPM2C3SC.Bits.MS3B
#define TPM2C3SC_CHxIE    _TPM2C3SC.Bits.CH3IE
#define TPM2C3SC_CHxF     _TPM2C3SC.Bits.CH3F

#define TPM2C4SC_ELSxA    _TPM2C4SC.Bits.ELS4A
#define TPM2C4SC_ELSxB    _TPM2C4SC.Bits.ELS4B
#define TPM2C4SC_MSxA     _TPM2C4SC.Bits.MS4A
#define TPM2C4SC_MSxB     _TPM2C4SC.Bits.MS4B
#define TPM2C4SC_CHxIE    _TPM2C4SC.Bits.CH4IE
#define TPM2C4SC_CHxF     _TPM2C4SC.Bits.CH4F
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */
/*
 * Follows changes from the database 2.87.167 version */
#define IIC1A_ADDR_BITNUM                IIC1A_ADDR_1_BITNUM
#define IIC1A_ADDR_MASK                  IIC1A_ADDR_1_MASK
#define IIC1A_ADDR0                      This_symb_has_been_depreciated
#define IIC1A_ADDR0_MASK                 This_symb_has_been_depreciated
#endif
/*lint -restore  +esym(961,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
